class Content:
    def __init__(self):
        from os import path
        import sys
        import json
        sys.path.insert(0, '../')
        with open(path.abspath(path.join(path.dirname(__file__), 'jsons/localizations.json')), 'r', encoding="utf-8") as f:
            data: dict = dict(json.load(f))
            self.global_ = data['global']
            self.actions = data['actions']
            self.tabs = data['tabs']
            self.auth = data['auth']

        self.cities = {
            "en": {
                0: 'Alex',
                1: 'Aswan',
                2: 'Asyut',
                3: 'Behira',
                4: 'Beni Suef',
                5: 'Cairo',
                6: 'Dakahlia',
                7: 'Damietta',
                8: 'Faiyum',
                9: 'Gharbia',
                10: 'Giza',
                11: 'Ismailia',
                12: 'Kafr Sheikh',
                13: 'Luxor',
                14: 'Matruh',
                15: 'Minya',
                16: 'Monufia',
                17: 'Wadi Geded',
                18: 'North Sinai',
                19: 'Port Said',
                20: 'Qalyubia',
                21: 'Qena',
                22: 'Red Sea',
                23: 'Sharqia',
                24: 'Sohag',
                25: 'South Sinai',
                26: 'Suez',
            },
            "ar": {
                0: "الاسكندرية",
                1: "أسوان",
                2: "أسيوط",
                3: "البحيرة",
                4: "بني سويف",
                5: "القاهرة",
                6: "الدقهلية",
                7: "دمياط",
                8: "الفيوم",
                9: "الغربية",
                10: "الجيزة",
                11: "الاسماعيلية",
                12: "كفر الشيخ",
                13: "الأقصر",
                14: "مرسى مطروح",
                15: "المنيا",
                16: "المنوفية",
                17: "الوادي الجديد",
                18: "شمال سيناء",
                19: "بور سعيد ",
                20: "القليوبية",
                21: "قنا",
                22: "البحر الأحمر",
                23: "الشرقية",
                24: "سوهاج",
                25: "جنوب سيناء",
                26: "السويس"
            }
        }

        self.genders = {
            "en": {
                0: "Male",
                1: "Female",
                2: "Prefer not to say!",
            },
            "ar": {
                0: "ذكر",
                1: "أنثى",
                2: "تفضل ألا تقول"
            }
        }

        self.toast_content = {
            "en": {},
            "ar": {},
        }

        self.terms_and_conditions = {
            "en": """
            """,
            "ar": """
تتكون هذه الشروط والأحكام من الأقسام التالية: 1. مقدمة. 2. شروط الشراء؛ 3. استخدام الموقع و 4. مجموعة متنوعة ، بالإضافة إلى السياسة أو مجموعة الشروط أو المستندات التي تم توفير رابط لها هنا (يشار إليها مجتمعة باسم "الشروط والأحكام").
1. مقدمة
شبكة الاتصالات العالمية. يتم تشغيل bra7tak.com ("الموقع الإلكتروني") من قبل أو نيابة عن Fields LLC.("Bra7tak"). بقبول هذه الشروط والأحكام، سيتم الانتهاء من طلبك على الاشتراك في هذا الموقع وستخضع العلاقة بينك وبين Bra7tak لهذه الشروط والأحكام.
الحقول هي الشركة الأم ل Bra7tak ، والتي تضم العديد من الشركات التابعة ؛ من بينها ، Bra7tak. (يشار إليها معا فيما يلي باسم " Bra7tak / نحن / لنا").
2. شروط الشراء
يرجى قراءة شروط الشراء هذه بعناية قبل طلب المنتجات عبر الإنترنت من الموقع.
2.1 متى تسري شروط الشراء هذه؟
تنطبق شروط الشراء هذه على جميع العروض والعقود ، بما في ذلك اتفاقية البيع عن بعد ، المتعلقة ببيع وتسليم المنتجات من قبلنا. بمعنى آخر ، أنت توافق على شروط الشراء هذه ، عندما (1) تطلب أي شيء من موقع الويب ، (2) تطلب أي شيء في أي صفحة ويب متصلة مباشرة بالموقع الإلكتروني أو (3) عندما تقبل عرضا منا. لا يمكن الخروج عن شروط الشراء هذه إلا إذا تم الاتفاق عليها كتابيا من قبلنا.
2.2 المنتجات
لدينا أنواع مختلفة من المنتجات التي قد يتم عرضها على الموقع من وقت لآخر. ("المنتجات").
يرجى ملاحظة أنه في حالة الإصدار المحدود أو منتجات الإنتاج المحدود ، قد يتم تطبيق قيود إضافية مثل الحد من عدد هذه المنتجات لكل عميل. سيتم إعلامك بهذه القيود الإضافية عبر الموقع الإلكتروني.
تخضع جميع المنتجات المعروضة على الموقع الإلكتروني للتوافر. هذا يعني أنه على الرغم من أننا نسعى جاهدين لضمان أن يعكس موقعنا الإلكتروني توفر المخزون ، فقد لا يكون المنتج المعروض على الموقع متاحا للشراء.
من الممكن حدوث اختلافات طفيفة في اللون والاختلافات الأخرى في المنتجات نتيجة لاختلاف الحصول على الصور أو تقنيات العرض أو لأسباب فنية أخرى. Bra7tak ليست مسؤولة عن هذه الاختلافات والانحرافات. لا يمكن اشتقاق أي حقوق من أخطاء الكتابة أو أوصاف المنتج أو أخطاء البيان على الموقع. يحق للعميل دائما الانسحاب كما هو متوقع في اتفاقية البيع عن بعد.
2.3 متطلبات إبرام عقد مع براحتك
يجب أن يكون عمرك 21 عاما أو أكثر وألا تكون غير مؤهل قانونا للدخول في عقود لشراء المنتجات عبر الموقع الإلكتروني.
لا يمكنك الطلب على الموقع الإلكتروني إلا إذا كنت مستهلكا خاصا ، وليس موزعا
أنت تضمن أن المعلومات التي تقدمها لنا في الطلب أو الطلب دقيقة وكاملة.
2.4 كيف يتم إبرام العقد معك؟
2-4-1 الجوانب العامة لتكوين العقود
ينطبق ما يلي على جميع أنواع المنتجات. جميع المعلومات الموجودة على الموقع هي دعوة للمعاملات فقط. بمعنى آخر ، المعلومات ليست عرضا أو عقدا ملزما. أنت توافق على أن طلبك هو عرض لشراء المنتجات المدرجة في طلبك.
تخضع جميع الطلبات المقدمة من قبلك للقبول من قبلنا. يحق لنا التحقق من الطلب مقدما في جميع الأوقات و / أو رفض قبول الطلب دون إبداء الأسباب ودون أي مسؤولية تجاهك أو تجاه أي طرف ثالث. إذا لم نؤكد قبول طلبك في غضون عشرة أيام عمل ، اعتباره مرفوضا.
قبل إنشاء اتفاقية بيع ، قد نختار عدم قبول طلبك وفقا لتقديرنا الخاص. فيما يلي أمثلة على الحالات التي قد لا نقبل فيها طلبك:
إذا تم عرض المنتج (المنتجات) على الموقع الإلكتروني ولكنها لم تكن متوفرة أو لم تعد متوفرة ؛ إذا لم نتمكن من الحصول على إذن بدفعتك؛ إذا كانت قيود الشحن تنطبق على المنتج ؛
إذا كان المنتج (المنتجات) المعروضة على الموقع تحتوي على خطأ (واضح) مثل تسعيرها بشكل غير صحيح أو وصفها بشكل غير صحيح.
في حالة عدم قبولنا (جزء من) طلبك ، يحق لنا إلغاء (جزء من) طلبك دون تحمل أي مسؤولية تجاهك أو تجاه طرف ثالث. بعد الإلغاء ، سنقدم لك بالطبع استردادا للمبلغ المدفوع لنا (والذي تلقيناه) بموجب الطلب الملغى (جزء من).
بعد إنشاء اتفاقية البيع ، نحتفظ بالحق في إلغاء طلبك بعد إنشاء عقد البيع ، وبالتالي إنهاء عقد البيع ، للأسباب المنصوص عليها في اتفاقية البيع عن بعد. بعد الإلغاء ، سنقدم لك بالطبع استردادا للمبلغ المدفوع لنا بموجب الطلب الملغى (جزء من).
تمتلك "براحتك" وتحتفظ بالحق الكامل في رفض قبول أي طلب تعرفه أو تشك بشكل معقول في أنه تم إجراؤه بمساعدة أو مشاركة أي برنامج أو روبوت أو أي وسيلة أو جهاز آلي آخر.
2.4.2 الجوانب الخاصة لتكوين العقود للمنتجات
بعد تقديم طلبك ، سنرسل إليك بريدا إلكترونيا لإقرار الطلب يحتوي على رقم طلبك وتفاصيل المنتجات التي عرضت شرائها وتفاصيل أي خدمات توصيل.
يرجى ملاحظة أن وظيفة Click &Collect المتوفرة على موقع الويب في بلدك ، قد لا تتضمن خيار طلب المنتج ودفعه على موقع الويب ، ولكنها تمنحك خيار حجز منتج على موقع الويب ثم شرائه وبالتالي دفع ثمنه محليا في متجر Bra7tak. حجز Click &Collect هذا ممكن فقط في  متاجر Bra7tak المحددة  كما هو موضح أثناء عملية الدفع على الموقع. إذا قمت بشراء المنتج المحجوز ، فأنت تبرم اتفاقية شراء مع  بائع التجزئة Bra7tak الذي تختاره محليا. هذا يعني أنه يمكنك فقط إرجاع المنتج (المنتجات) إلى نفس المتجر الذي اشتريته منه ، وفقا لسياسة الإرجاع الخاصة بهذا المتجر. لذلك لا تنطبق الأقسام 2.13 و 2.14 و 2.15 أدناه لأنها تنطبق فقط على إرجاع المنتجات المشتراة من خلال الموقع.
2-5 الاحتفاظ بحق الملكية
ستبقى جميع المنتجات ملكا ل "براحتك"  حتى تقوم بدفع جميع المبالغ المستحقة لنا بالكامل بموجب أي اتفاقية ، بما في ذلك دفع التكاليف أو التسليم المبكر أو اللاحق أو التسليم الجزئي. لا يجوز لك بيع أي منتج أو التخلص منه أو رهنه قبل أن تنتقل ملكيته الكاملة إليك.
2.6 صيانة المنتجات
نلفت انتباهك إلى تعليمات الغسيل والصيانة المطبوعة على ملصقات المنتجات. نحن لسنا مسؤولين عن أي ضرر ناتج عن التعامل غير الصحيح مع المنتجات ، بما في ذلك التعامل المخالف للتعليمات.
2.7 إلغاء الطلب
يرجى الاطلاع على اتفاقية البيع عن بعد ونموذج المعلومات الأولية و / أو يرجى الاتصال بخدمة العملاء لمزيد من التفاصيل.
2.8 السعر
الأسعار المذكورة تشمل ضريبة القيمة المضافة. الأسعار بالجنيه المصري. تحتفظ "براحتك" بالحق في إجراء تغييرات في الأسعار قبل تقديم طلب من قبلك. نحتفظ بالحق في تغيير أو تقييد أو إنهاء أي عروض أو خصومات خاصة في أي وقت.
سيتم تحديد التكاليف الإضافية مثل الشحن والمناولة والتسليم والبريد والتأمين ، وإذا أمكن ، الرسوم الجمركية والضرائب الحكومية الأخرى ، وسيتم تحميلها عليك بشكل منفصل. تختلف التكاليف لكل منتج ونوع التسليم. لمزيد من التفاصيل ، يرجى الاطلاع على القسم 2.12 أو الانتقال إلى قسم التسليم على الموقع. سيتم فرض جميع التكاليف الإضافية بشكل منفصل ومفصلة وإضافتها إلى المبلغ الإجمالي للطلب.
2.9 طرق الدفع
يرجى مراجعة الموقع للحصول على معلومات حول طرق الدفع المتاحة. تحتفظ "براحتك"  بالحق في إجراء فحص ائتماني فردي لكل طلب وفقا  لبيان خصوصية "براحتك". اعتمادا على نتائج هذا الفحص ،  تحتفظ "براحتك" بالحق في رفض طرق دفع معينة.
2.10 الفواتير
عندما نختار ، أو يطلب منا بموجب القانون المعمول به ، إصدار فاتورة أو إتاحتها ، فإننا نحتفظ بالحق في إصدار أو إتاحة الفواتير الإلكترونية وأنت توافق على هذا الشكل من الفواتير.
2.11 التسليم
سنقوم بالتوصيل إلى العنوان الذي أشرت إليه داخل أراضي مصر. يمكننا فقط التسليم إلى عنوان المنزل أو المكتب أو موقع استلام الناقل أو إذا اخترت استلام المنتجات من متجر "براحتك"  ، إلى عنوان متجر "براحتك"  ذي الصلة  . سنؤكد لك ذلك عن طريق البريد الإلكتروني عند إبلاغك بأن المنتجات جاهزة لاستلامها. إذا لم تنجح محاولة التسليم، فإنك توافق على أن شركة النقل التي تعاقدنا معها للتسليم قد تقوم أيضا بتسليم المنتجات إلى نقطة الاستلام، وبعد ذلك  تعتبر "براحتك"  قد أوفت بالتزامها بتسليم المنتجات. سيقوم الناقل بإخطارك بالتسليم إلى نقطة الاستلام.
الشحن المجاني متاح للتسليم القياسي للطلبات التي تزيد عن الحد الأدنى للإنفاق على الشراء والذي سيتم تحديده (يخضع للمراجعة من وقت لآخر وفقا لتقديرنا الخاص). لن تكون هناك رسوم شحن إذا اخترت النقر والاستلام من متاجرنا / متجر التجميع / نقطة نقطة التجميع الذاتي ، كما قد يتم تحديده بواسطة "براحتك" من وقت لآخر
سيتم شحن الطلبات في أيام العمل ، وليس عطلة رسمية في المنطقة التي يقع فيها مستودعاتنا. لذلك ، يرجى النظر في أي أيام عطل رسمية بما في ذلك أي عطلات وطنية و / أو إقليمية في بلد إقامتك. سيتم التسليم في أيام العمل ، وليس عطلة رسمية
للحصول على معلومات مفصلة حول فترات التسليم ، يرجى التحقق من المواصفات الخاصة بأنواع التسليم المختلفة في قسم التسليم على موقعنا. فترات التسليم إرشادية وبالتالي لا تعتبر مواعيد نهائية صارمة. مجرد تجاوز فترة التسليم لا يخولك الحصول على تعويض وأنت تتنازل بموجب هذا عن حقوقك في المطالبة. على الرغم من ذلك ، في حالة حدوث تأخير غير محتمل في التسليم السريع ، يجوز لنا ، وفقا لتقديرنا ، رد التكلفة الكاملة للتسليم السريع إليك. هذا يعني أن طلبك الكامل للمنتجات سيستغرق وقتا أطول للتسليم.
يحق ل "براحتك" ، بقدر الإمكان بشكل معقول ، إجراء عمليات تسليم مقسمة حتى تتلقى منتجاتك في أقرب وقت ممكن. لا توجد تكاليف إضافية مرتبطة بعمليات التسليم المجزأة هذه. ومع ذلك ، إذا طلبت منا التسليم في أجزاء ، فقد نفرض عليك تكاليف توصيل إضافية. يجب أن يشكل كل أمر مجزأ عقد بيع منفصل. إذا طلب العميل عمليات تسليم مقسمة وإذا تأخرنا في تسليم جزء أو كان هناك خطأ في طلب مقسم ، فلن يؤهلك ذلك لإلغاء أي جزء آخر من الطلب المقسم.
في الحالة غير المحتملة التي لا يمكننا أو لا يمكننا أو لم يعد بإمكاننا تسليم (جزء من) طلبك ولسنا مسؤولين عن هذا الموقف ، يحق لنا إنهاء عقد البيع إلى الحد الذي تسمح به اتفاقيات البيع عن بعد. سنقوم ، بالطبع ، بإبلاغك في أقرب وقت ممكن عمليا وعلى أبعد تقدير خلال الفترة المتوقعة بموجب اتفاقية البيع عن بعد وسداد أي مدفوعات تم إجراؤها.
2.12 المرتجعات والمبالغ المستردة
للحصول على معلومات حول المرتجعات والمبالغ المستردة ، يرجى الاطلاع على اتفاقية البيع عن بعد ونموذج المعلومات الأولية وقسم المرتجعات والمبالغ المستردة على موقعنا.
2.13 سياسة الاستبدال
نحن لا نستبدل المنتجات. إذا كنت ترغب في استبدال منتج ، فستحتاج إلى إرجاع مشترياتك لاسترداد الأموال وتقديم طلب جديد. من الممكن فقط استرداد الأموال عند المرتجعات عندما يتماشى الإرجاع مع سياسة الإرجاع والاسترداد الخاصة بنا كما هو منصوص عليه في القسم 2.12.
2.14 المنتجات التالفة أو المعيبة
بالنسبة ل "براحتك"  ، الجودة لها أهمية قصوى. نحن نختبر بدقة جميع منتجاتنا في ظروف الحياة الواقعية للتأكد من أنها قادرة تماما على الوقوف في وجه الاستخدامات التي صممت من أجلها. من النادر جدا أن تتعرض منتجاتنا للتلف أو العيوب. "براحتك" لديها التزام قانوني للتأكد من أن منتجاتنا تتوافق مع عقد البيع.
يتم فحص المنتجات المرتجعة من قبل قسم ضمان الجودة "براحتك" واستردادها إذا كان الضرر ناتجا عن عيب في التصنيع أو انحراف عن مواصفات المصنع. نتعهد برد تكلفة أي منتجات معيبة مصنعة بالكامل.
إذا كانت المشكلة ناتجة عن أسباب أخرى غير جودة المواد أو عملية التجميع ، إرجاع المنتج الأصلي إليك. نحن لا نرد المنتجات:
تم الحصول عليها من مصدر آخر غير الموقع الإلكتروني؛ التي تضررت بسبب سوء الاستخدام أو الإهمال (مثل التعرض للمواد الكيميائية والمواد الكاوية واللهب المكشوف والحرارة العالية والأدوات الحادة وما إلى ذلك) ؛ و / أو التي تضررت بسبب سوء الاستخدام أو الأنشطة بخلاف الغرض المقصود (مثل استخدام أحذية الجري لرياضات الملاعب أو أحذية المشي لمسافات طويلة كأحذية عمل ، وما إلى ذلك).
يرجى ملاحظة أن متوسط العمر المتوقع لأي منتج يعتمد على الفرد الذي يستخدم المنتج وشروط الاستخدام وأنماط التآكل المميزة للمستخدم. لا يتم استبدال منتجاتنا التي تضررت بسبب البلى العادي أو التي تجاوزت العمر الافتراضي المعقول للمنتج.
فريق خدمة العملاء لدينا متاح لمساعدتك. من فضلك لا تتردد في الاتصال بنا مع أسئلتك وتعليقاتك. اتصل بنا هنا.
3. استخدام الموقع
يرجى قراءة هذه الشروط والأحكام لاستخدام موقع الويب ("استخدام شروط وأحكام الموقع") بعناية قبل استخدام موقع الويب وأي محتوى خاص بنا على  مواقع التواصل الاجتماعي ، بما في ذلك على سبيل المثال لا الحصر فيس بوك و انستقرام (معا: "موقع الويب"). تنطبق شروط وأحكام استخدام الموقع الإلكتروني هذه على جميع زيارات واستخدامات الموقع ، وكذلك على المحتوى (كما هو موضح أدناه) والمعلومات والتوصيات والمنتجات والخدمات المقدمة لك على الموقع أو من خلاله. من خلال الوصول إلى الموقع واستخدامه ، فإنك تمنح موافقتك على شروط وأحكام استخدام الموقع بالكامل بالإضافة إلى أي قانون أو لائحة أخرى تنطبق على الموقع والإنترنت. إذا كنت لا توافق على شروط وأحكام استخدام الموقع ، فيرجى مغادرة الموقع على الفور
3.1 المحتوى على الموقع
جميع المحتويات المعروضة أو المعروضة على الموقع ، بما في ذلك ، على سبيل المثال لا الحصر ، الشعارات والأيقونات والعلامات التجارية والنصوص والرسومات والصور الفوتوغرافية والصور والصور المتحركة والصوت والرسوم التوضيحية والبرامج ("المحتوى") ، مملوكة لشركة "براحتك" أو الشركات التابعة لها أو المرخصين لها أو مزودي المحتوى التابعين لها. يمكن حماية جميع عناصر الموقع بما في ذلك ، على سبيل المثال لا الحصر ، التصميم العام والمحتوى ، بموجب حقوق النشر والحقوق المعنوية وحقوق قاعدة البيانات والعلامات التجارية والقوانين الأخرى المتعلقة بحقوق الملكية الفكرية. باستثناء ما هو مسموح به صراحة بموجب هذه الاتفاقية أو اتفاقية أخرى مع "براحتك" ، لا يجوز نسخ أو إعادة إرسال أي جزء أو عنصر من الموقع أو محتواه عبر أي وسيلة. يظل موقع الويب ومحتواه وجميع الحقوق ذات الصلة ملكية حصرية ل "براحتك" أو الشركات التابعة لها أو المرخصين لها ما لم يتم الاتفاق صراحة على خلاف ذلك. جميع هذه الحقوق محفوظة
3.2 حقوق النشر والعلامات التجارية
حقوق الطبع والنشر في جميع المحتويات هي ولا تزال مملوكة من قبل "براحتك" أو  الشركات التابعة لها أو المرخصين لها حسب الاقتضاء. باستثناء ما قد يشار إليه بخلاف ذلك في مستندات محددة داخل الموقع ، يحق لك عرض وتشغيل وطباعة وتنزيل المحتوى الموجود على الموقع لأغراض شخصية وإعلامية وغير تجارية فقط. لا يجوز لك تعديل أي من المواد ولا يجوز لك نسخ أو توزيع أو نقل أو عرض أو أداء أو إعادة إنتاج أو نشر أو ترخيص أو إنشاء أعمال مشتقة من أو نقل أو بيع أي محتوى. لا يجوز لك إعادة استخدام أي محتوى دون الحصول أولا على موافقة "براحتك". لأغراض هذه الشروط ، يحظر استخدام أي محتوى من هذا القبيل على أي موقع ويب آخر أو بيئة كمبيوتر متصلة بالشبكة. لن تقوم بإزالة أي حقوق نشر أو علامة تجارية أو إشعارات ملكية أخرى من المحتوى الموجود على الموقع.
في حالة تنزيل البرنامج (بما في ذلك على سبيل المثال لا الحصر شاشات التوقف وتطبيقات الهواتف الذكية والأيقونات ومقاطع الفيديو والخلفيات) من موقع الويب ، فإن البرنامج ، بما في ذلك أي ملفات وصور مدمجة في البرنامج أو تم إنشاؤها بواسطة البرنامج والبيانات المصاحبة للبرنامج (يشار إليها مجتمعة باسم "البرنامج") مرخصة لك من قبل "براحتك".  لا تقوم "براحتك"  بنقل ملكية البرنامج إليك. أنت تمتلك الوسيط الذي يتم تسجيل البرنامج عليه، ولكن تحتفظ "براحتك"  بالملكية الكاملة والكاملة للبرنامج، وجميع حقوق الملكية الفكرية فيه. لا يجوز لك إعادة توزيع البرنامج أو بيعه أو إلغاء تجميعه أو إجراء هندسة عكسية له أو تفكيكه أو تقليله إلى شكل يمكن للبشر قراءته.
تظل جميع العلامات التجارية وعلامات الخدمة والشعارات والأسماء التجارية التي تظهر على منتجات مجموعة "براحتك" وتغليف المنتجات و / أو على موقع الويب ، سواء كانت مسجلة أم لا ("العلامات التجارية") ملكية حصرية ل "براحتك" أو الشركات التابعة لها أو المرخصين لها (حسب الاقتضاء) ومحمية بموجب قوانين ومعاهدات العلامات التجارية المعمول بها. لا يجوز لك استخدام أو نسخ أو إعادة إنتاج أو إعادة نشر أو تحميل أو نشر أو نقل أو توزيع أو تعديل أي من العلامات التجارية بأي شكل من الأشكال، بما في ذلك في الإعلان أو الدعاية المتعلقة بتوزيع المواد على الموقع، دون  موافقة كتابية مسبقة من "براحتك". يحظر استخدام أي من العلامات التجارية على أي موقع ويب آخر أو بيئة كمبيوتر شبكية ، على سبيل المثال تخزين أو إعادة إنتاج (جزء من) الموقع في أي موقع ويب خارجي أو إنشاء روابط أو نصوص تشعبية أو روابط أو روابط عميقة بين الموقع وأي مواقع إنترنت أخرى ، دون موافقة كتابية صريحة من "براحتك".
3.3 إخلاء المسؤولية عن الضمانات
الموقع والمحتوى مجانيان ويتم توفيرهما "كما هو" وبدون أي ضمانات من أي نوع. المعلومات الموجودة على الموقع هي لأغراض المعلومات العامة فقط ولا تشكل نصيحة.
 "براحتك" لا تمثل أو تضمن أن المعلومات و / أو التسهيلات الواردة في الموقع دقيقة أو كاملة أو حديثة ، أو أن الموقع أو الخادم الذي يجعل الموقع متاحا خاليا من الفيروسات أو أي مكونات ضارة أخرى. علاوة على ذلك ،  لن توفر "براحتك" بنية تحتية محددة لتكنولوجيا المعلومات أو الاتصال. وبالتالي ،  لا يمكن ل "براحتك" تمثيل أو ضمان أن الموقع سيكون دون انقطاع أو خاليا من الأخطاء.  لا تقدم "براحتك" أي ضمانات أو إقرارات فيما يتعلق باستخدام المحتوى على الموقع من حيث صحتها أو دقتها أو كفايتها أو فائدتها أو توقيتها أو موثوقيتها أو غير ذلك ، في كل حالة إلى أقصى حد يسمح به القانون المعمول به.
3.4 تحديد المسؤولية
استخدامك لهذا الموقع هو على مسؤوليتك الخاصة. عندما لا يمكن استبعاد الشروط أو الضمانات أو ضمانات المستهلك الضمنية أو المطبقة بموجب القانون ، تحد "براحتك" من  مسؤوليتها ، حيث يحق لها القيام بذلك: فيما يتعلق بالخدمات ، لإعادة توريد الخدمات ذات الصلة أو دفع تكلفة إعادة التوريد ؛ وفيما يتعلق بالسلع ، إصلاح أو استبدال السلع ذات الصلة أو دفع تكلفة هذا الإصلاح أو الاستبدال. خلاف ذلك ، إلى أقصى حد يسمح به القانون ، لا تتحمل "براحتك" أو أي من  موظفيها أو مسؤوليها أو مديريها أو أي من وكلائها أو مقاوليها أو أي طرف آخر مشارك في إنشاء أو إنتاج أو تسليم هذا الموقع أو أي محتوى المسؤولية (وأنت بموجب هذا تعفي الكيانات المذكورة أعلاه من أي وجميع المسؤولية) عن أي مباشرة ،  الخسارة أو الضرر غير المباشر أو الخاص أو التبعي أو غيره لأي شخص أو كيان ، مهما كان سببه (سواء عن طريق الإهمال أو غير ذلك) الذي ينتج عن استخدام أو عدم القدرة على استخدام هذا الموقع أو المحتوى أو أي مادة أو منتج آخر يتم توفيره لك عبر هذا الموقع ، بما في ذلك الضرر الناجم عن الفيروسات أو أي عدم صحة أو عدم اكتمال المعلومات الموجودة على هذا الموقع ،  أو المتعلقة بأداء المنتجات التي تم الحصول عليها عبر هذا الموقع أو الناشئة بطريقة أخرى عن أو فيما يتعلق بهذا الموقع أو الشروط والأحكام، حتى لو  تم إخطار "براحتك" بإمكانية حدوث أي خسارة أو ضرر من هذا القبيل.
3.5 روابط لأطراف ثالثة
من أجل راحتك ولتحسين استخدام الموقع ، قد يتم توفير روابط لمواقع الويب التي تملكها وتتحكم فيها أطراف ثالثة من وقت لآخر. تأخذك هذه الروابط خارج خدمة "براحتك" وخارج الموقع الإلكتروني وهي خارجة عن  سيطرة "براحتك". يتضمن ذلك روابط للشركاء الذين قد يستخدمون العلامات التجارية كجزء من اتفاقية العلامة التجارية المشتركة. مواقع الويب التي يمكنك ربطها لها شروط وأحكام منفصلة خاصة بها بالإضافة إلى سياسة خصوصية. "براحتك" ليست مسؤولة ولا يمكن أن تكون مسؤولة عن محتوى وأنشطة هذه المواقع. لذلك تقوم بزيارة / الوصول إلى هذه المواقع بالكامل على مسؤوليتك الخاصة.
يرجى ملاحظة أن هذه المواقع الأخرى قد ترسل ملفات تعريف الارتباط الخاصة بها إلى المستخدمين أو تجمع البيانات أو تطلب معلومات شخصية ، وبالتالي ينصح بالتحقق من شروط الاستخدام و / أو سياسات الخصوصية على تلك المواقع قبل استخدامها.
3.6 إساءة استخدام الموقع
يحظر عليك استخدام الموقع الإلكتروني لنشر أو نقل أي محتوى من إنشاء المستخدم (كما هو موضح أدناه) ينتهك أو قد ينتهك حقوق الملكية الفكرية لطرف ثالث أو يهدد أو كاذب أو مضلل أو تحريضي أو تشهيري أو منتهك للخصوصية أو فاحش أو إباحي أو مسيء أو تمييزي أو غير قانوني أو يمكن أن يشكل أو يشجع على سلوك يعتبر جريمة جنائية ،  تنتهك حقوق أي طرف أو التي قد تؤدي إلى مسؤولية مدنية أو تنتهك أي قانون.  قد يمنعك "براحتك" من الوصول إلى الموقع في أي وقت وفقا لتقديرها الخاص ، والتي يجب أن تشمل الحالات التي  تعتقد فيها "براحتك" أن استخدامك للموقع ينتهك أيا من شروط وأحكام استخدام الموقع و / أو القوانين المعمول بها. 
يحظر عليك أيضا استخدام الموقع للإعلان أو تنفيذ أي التماس تجاري. لا يجوز لك استخدام أي برنامج أو روبوت أو زاحف أو عنكبوت أو مكشطة صفحات أو أي وسيلة أو جهاز آلي آخر من أجل (أ) الوصول إلى أي جزء من الموقع أو محتواه أو نسخه أو التأثير عليه أو مراقبته أو التحايل على هيكل أو عرض الموقع أو أي من محتوياته أو (ب) للتدخل في تشغيل الموقع أو أي معاملة يتم إجراؤها على الموقع أو التدخل أو التأثير على استخدام أي شخص للموقع أو للمساعدة في تسهيل أي طرف ثالث لشراء أي منتج على الموقع.
لا يجوز لك محاولة الوصول غير المصرح به إلى أي جزء أو ميزة من الموقع أو أي نظام متصل بالموقع عن طريق القرصنة أو استخراج كلمة المرور أو غيرها من الوسائل غير المشروعة أو غير المصرح بها.
3.7 المحتوى الذي ينشئه المستخدم
جميع الآراء والملاحظات والتعليقات والأعمال الفنية والرسومات والصور الفوتوغرافية والروابط والأسئلة والاقتراحات والمعلومات ومقاطع الفيديو والمواد الأخرى التي تنشرها أنت أو المستخدمون الآخرون للموقع على الموقع الإلكتروني أو تنقلها باستخدام الموقع ("المحتوى الذي ينشئه المستخدم") ستعتبر غير سرية وغير مملوكة. وفقا لذلك ، يكون ل "براحتك"  الحق غير الحصري والخالي من حقوق الملكية في استخدام ونسخ وتوزيع والكشف عن أي محتوى ينشئه المستخدم لأطراف ثالثة لأي غرض ، في أي وسيط وفي جميع أنحاء العالم (منح الترخيص). أنت تقر وتوافق على أن "براحتك" تعمل فقط كقناة سلبية لتوزيع المحتوى الذي ينشئه المستخدم وليست مسؤولة أو مسؤولة تجاهك أو تجاه أي طرف ثالث عن محتوى أو دقة المحتوى الذي ينشئه المستخدم.  لا يجوز ل "براحتك"  مراقبة المحتوى الذي ينشئه المستخدم الذي تنشره أنت أو الإشراف بين المستخدمين بشكل مستمر ، ولن  تكون "براحتك" ملزمة بالقيام بذلك. دون تقييد لعمومية ما سبق، فإنك تقر وتوافق على أن أي ملاحظات وآراء وتعليقات واقتراحات وغيرها من المعلومات المعبر عنها أو المدرجة في المحتوى الذي ينشئه المستخدم لا تمثل بالضرورة تلك الخاصة ب "براحتك". أي استخدام من جانبك للمحتوى الذي ينشئه المستخدم يكون على مسؤوليتك الخاصة تماما. أنت تقر وتضمن أن أي محتوى ينشئه المستخدم يتم نشره أو نقله بواسطتك أصلي لك ولا ينسخ عمل أي طرف ثالث أو ينتهك حقوق الملكية الفكرية لأي طرف ثالث أو حقوق الخصوصية أو حقوق الشخصية ولا يحتوي على أي بيانات تشهيرية أو مهينة. علاوة على ذلك ، فإنك تقر وتضمن أن لديك القدرة على منح الترخيص كما هو منصوص عليه في هذه الفقرة. أنت توافق على تعويض  "براحتك"  والشركات التابعة لها والحفاظ  عليها مقابل جميع التكاليف والنفقات والأضرار والخسائر والمسؤوليات  التي تكبدتها أو تكبدتها "براحتك" أو  الشركات التابعة لها فيما يتعلق بأي محتوى من إنشاء المستخدم تم نشره أو نقله بواسطتك أو استخدامك الآخر للموقع.
تحتفظ "براحتك" بالحق وفقا لتقديرها الخاص في حظر أو إزالة (كليا أو جزئيا) أي محتوى من إنشاء المستخدم تم نشره أو نقله بواسطتك والذي  تعتقد "براحتك" أنه لا يتوافق مع شروط وأحكام استخدام موقع الويب هذه (بما في ذلك المواد التي تنتهك أو قد تنتهك حقوق الملكية الفكرية لطرف ثالث أو حقوق الخصوصية أو حقوق الشخصية) ،  أو غير مقبول ل "براحتك".
أنت توافق على إخطار "براحتك"  كتابيا على الفور (انظر كيفية الاتصال بنا أدناه للحصول على تفاصيل الاتصال) بأي محتوى من إنشاء المستخدم (أو محتوى آخر) ينتهك شروط وأحكام استخدام موقع الويب هذه. أنت توافق على تزويد "براحتك"  بمعلومات كافية لتمكين "براحتك"  من التحقيق فيما إذا كان هذا المحتوى الذي ينشئه المستخدم (أو محتوى آخر) ينتهك شروط وأحكام استخدام موقع الويب هذه.  توافق "براحتك"   على بذل جهود بحسن نية للتحقيق في هذه الشكوى ويجب أن تتخذ الإجراء الذي  تقرره "براحتك"  وفقا لتقديرها الخاص. ومع ذلك ،  لا تضمن "براحتك"  أو  تقر بأنها ستمنع أو تزيل (كليا أو جزئيا) هذا المحتوى الذي ينشئه المستخدم أو المحتوى الآخر.
3.8 الأفكار غير المرغوب فيها
تحافظ "براحتك" على سياسة عدم مراجعة أو قبول أي عمليات إرسال غير مرغوب فيها للأفكار والاختراعات والتصاميم و / أو المواد الأخرى المتعلقة بأعمال  "براحتك"   (بما في ذلك على سبيل المثال لا الحصر الأحذية والملابس والسلع والخدمات الرياضية) سواء كانت تتكون من نصوص أو صور أو أصوات أو برامج أو معلومات أو غير ذلك ("المواد") من أشخاص خارج "براحتك". لذلك يجب عليك عدم نشر أي مواد على الموقع أو إرسالها إلى "براحتك" عن طريق البريد الإلكتروني أو غير ذلك.
4. متفرقات
4.1 كيف يمكنك الاتصال بنا؟
إذا كان لديك أي أسئلة أو تعليقات حول الموقع أو شروط وأحكام "براحتك"  أو في حالة رغبتك في تقديم شكوى ، فيرجى عدم التردد في الاتصال بخدمة العملاء بالنقر هنا.
بدلا من ذلك ، يمكنك أيضا الكتابة إلينا باستخدام العنوان التالي: info@bra7tak.com
4.2 الأولويات
في حالة وجود تعارض بين شروط وأحكام "براحتك" وأي محتوى وارد في أجزاء أخرى من الموقع أو في الروابط ،  تسود شروط وأحكام "براحتك" الواردة في هذا المستند باستثناء اتفاقية البيع عن بعد والمعلومات الأولية ل
4.3 التعديلات على  شروط وأحكام "براحتك"
نحتفظ بالحق في إجراء تغييرات على هذه الشروط والأحكام في أي وقت وفقا لتقديرنا الخاص ودون الرجوع إليك حيث توافق على الشروط والأحكام الحالية المطبقة عليك وفقا لذلك.
سيخضع استخدام هذا الموقع بالإضافة إلى أي اتفاقية شراء مبرمة بينك وبيننا لإصدار شروط وأحكام "براحتك" السارية في وقت تقديم الطلب من خلال هذا الموقع أو في اليوم الذي تتصفح فيه هذا الموقع (حسب الاقتضاء). يرجى مراجعة  شروط وأحكام "براحتك" بشكل دوري لمعرفة التغييرات.
4.4 حماية البيانات
تحترم "براحتك" تماما خصوصية الأفراد الذين يصلون إلى الموقع ويستخدمونه. للحصول على تفاصيل حول الطريقة التي نستخدم بها ملفات تعريف الارتباط ، ونوع المعلومات التي نجمعها ، وكيف ولأي غرض ، نستخدم معلوماتك وتحت أي ظروف نكشف عن المعلومات ، يرجى الاطلاع على بيان الخصوصية وسياسة ملفات تعريف الارتباط الخاصة بنا ، والتي يتم دمجها في شروط وأحكام "براحتك" هذه وتشكل جزءا منها  .
من خلال تقديم طلب شراء ، فإنك توافق وتفهم أنه يجوز لنا جمع بياناتك الشخصية واستخدامها وتخزينها ومعالجتها وفقا لبيان الخصوصية الخاص بنا.
4.5 الفصل
يجب تفسير كل شرط من شروط وأحكام "براحتك" بشكل منفصل ومستقل عن بعضها البعض. إذا تم اعتبار أي حكم غير صالح أو باطل أو غير قابل للتنفيذ بأي شكل آخر، يعتبر هذا الحكم قابلا للفصل ولن يؤثر على قابلية تنفيذ أي من الأحكام الأخرى لشروط  وأحكام "براحتك" هذه.
4-6 التعاقد من الباطن والإحالة
تحتفظ "براحتك" بالحق في التعاقد من الباطن أو نقل أو التنازل عن أو تجديد كل أو أي من حقوقنا والتزاماتنا بموجب شروط وأحكام  "براحتك"  بشرط ألا تتأثر حقوقك بموجب شروط  وأحكام "براحتك" ويسمح بها القانون. لا يجوز لك التعاقد من الباطن أو التنازل عن أو نقل أي من حقوقك أو التزاماتك بموجب  شروط وأحكام "براحتك" دون موافقتنا كتابية.
4.7 الأحداث الخارجة عن السيطرة المعقولة
لن تكون "براحتك" مسؤولة عن أي تأخير أو فشل في أداء أو الامتثال لالتزاماتنا بموجب  شروط وأحكام "براحتك" عندما ينشأ التأخير أو الفشل عن أي سبب خارج عن  سيطرة "براحتك" المعقولة.
4.8 القانون المعمول به والاختصاص القضائي
تخضع شروط وأحكام "براحتك" لقوانين مصر. يخضع أي نزاع قد ينشأ بموجب هذه الشروط والأحكام للاختصاص القضائي الحصري لمحاكم مصر حسب مقتضى الحال.

"""
        }

        self.refund_policy = {
            "en": """
            Exchanges
•	Orders are exchangeable within 14 days from delivery, and 30 days for defective items.
•	Products must be exchanged in unused condition with the original packaging.
•	In case of receiving a physically damaged product(s) or wrong, a different product(s) exchange will be done for free within 2-5 working days inside Cairo, and 4-7 working days outside Cairo.
•	In the case of exchanging normal orders, shipping fees will be added.
 
   Refunds
•	Orders are refundable within 14 days from issuing the receipt.

•	Products must be returned in unused condition with the original packaging.
•	In case of receiving a wrong product or a defective product, the full amount will be refunded without any shipping fees.
•	In case of a refund due to a change of mind, shipping fees will be deducted from the product price value
            """,
            "ar": """
            الاستبدالات
•	يمكن استبدال الطلبات في غضون 14 يوما من التسليم ، و 30 يوما للعناصر المعيبة.
•	يجب استبدال المنتجات في حالة غير مستخدمة مع العبوة الأصلية.
•	في حالة استلام منتج (منتجات) تالفة ماديا أو خاطئة ، سيتم استبدال منتج (منتجات) مختلفة مجانا في غضون 2-5 أيام عمل داخل القاهرة ، و 4-7 أيام عمل خارج القاهرة.
•	في حالة استبدال الطلبات العادية سيتم إضافة رسوم الشحن.
 
المبالغ المسترده
•	الطلبات قابلة للاسترداد في غضون 14 يوما من إصدار الإيصال.

•	يجب إرجاع المنتجات في حالة غير مستخدمة مع العبوة الأصلية.
•	في حالة استلام منتج خاطئ أو منتج معيب ، سيتم استرداد المبلغ بالكامل دون أي رسوم شحن.
•	في حالة استرداد الأموال بسبب تغيير الرأي ، سيتم خصم رسوم الشحن من قيمة سعر المنتج


            """,
        }


        self.privacy_policy = {
            "en": """
            This Privacy Policy describes how we use and do not use information provided to us at bra7tak.com and the steps we take to protect it.
Information we collect online
To make a purchase on bra7tak.com, we require certain information such as your name, address, phone number, and email address. For billing purposes, you may also need to provide your credit card type, number, expiration date, and billing address. Your credit card information is securely submitted on the payment gateway of Paymob, and they do not share it with bra7tak.com. If your order is to be shipped, we also require the name, address, and phone number of the recipient(s).

You may create an account on our site using your email address and a unique access password. While an account is not required to visit our site, it allows you to save billing information and track your orders. For your security, we do not store credit card numbers in your account. You may change your saved account information at any time.

When you access bra7tak.com, small text files known as "cookies" will be stored on your computer's hard drive. These cookies allow us to enhance and personalize your shopping experience and improve the design of our site. Cookies store information about your visits, shopping cart contents, and preferences. You can adjust your web browser settings to notify you when you receive a cookie, and you can also erase cookies from your browser after shopping. However, deleting cookies may limit our ability to personalize bra7tak.com for your next visit.

We also collect certain technical information from your computer, such as your IP address, operating system, browser type, and the address of any referring website. This information cannot be used to identify you except in the case of IP addresses, which we may use to identify unauthorized activities and take legal action.
Text Marketing and notifications:
When you provide your phone number while making a purchase, subscribing through opt-in forms, or texting a keyword phrase, you give us permission to send you text messages. These messages may include information about our products, services, and promotions, as well as abandoned cart reminders. Please note that consent to receive text messages is not required for making a purchase, and message and data rates may apply. The frequency of messages may vary.

You can unsubscribe from receiving text messages at any time by replying STOP to any message sent from us or by clicking an unsubscribe link provided in any of our messages. Please note that manual requests to unsubscribe will not be considered reasonable means of unsubscribing from our text messages, and alternative options for opting out are available. For more information or any questions regarding our policy or unsubscribing, you can contact us at the provided email address.

Please follow the listed procedures to opt-out of receiving text messages from us.
Accessing and updating my information
It is important to protect your personal information and account credentials. If you suspect any unauthorized access or use of your account, please contact us immediately to take necessary steps to secure your account. We recommend that you change your password periodically to ensure maximum security.

If you do not have an account with bra7tak.com, you may still request to access and correct your personal information by contacting our customer service team. We will do our best to respond to your request in a timely manner.

Please note that we may need to retain certain information for record-keeping purposes or to complete transactions that you initiated prior to requesting a change or deletion of your information. In addition, we may not be able to remove all of your information from our backup systems or historical data. However, we will take reasonable steps to accommodate your request to the extent possible under applicable laws and regulations.
Privacy protection
We protect our databases with various physical, technical and procedural measures and we restrict access to your information by unauthorized persons.
We use Secure Sockets Layer (SSL) technology, which is the electronic commerce standard for securing information as it travels over the Internet. SSL technology is designed to encrypt your information, preventing an unauthorized party from viewing and downloading your information. Your web browser should display a web address with an “https” prefix, indicating that the SSL technology is operating when using certain portions of our website, such as Register & Check Out features.
Proprietary Rights
The content on bra7tak.com, which includes various types of material such as data, software, photographs, videos, music, and more, is protected by copyright, trademark, patent, and other proprietary rights. These rights are valid and will continue to be protected in all forms of media, both current and future.
Security
As a user of this website, it is your responsibility to keep your account and password secure and limit access to your device. You also agree to take responsibility for any actions taken under your account. Furthermore, the use of bra7tak.com is only allowed for lawful purposes.

            """,
            "ar": """
            المعلومات التي نجمعها عبر الإنترنت
المعلومات اللازمة لإجراء عملية شراء: عند إجراء عملية شراء ، نطلب اسمك وعنوانك ورقم هاتفك وعنوان بريدك الإلكتروني وغيرها من المعلومات اللازمة لإكمال طلبك وتتبعه. لأغراض الفوترة، قد تحتاج إلى تقديم نوع بطاقة الائتمان ورقمها وتاريخ انتهاء صلاحيتها وعنوان إرسال الفواتير للبطاقة. يتم إرسال معلومات بطاقة الائتمان هذه على بوابة الدفع الخاصة بشركة Paymob. لا تشارك شركة Paymob أيا من معلوماتك أو معلومات بطاقتك الائتمانية مع bra7tak.com. إذا كان سيتم شحن طلبك ، فنحن بحاجة أيضا إلى اسم وعنوان ورقم هاتف المستلم (المستلمين) المقصود.
المعلومات اللازمة لإنشاء حساب: يمكنك إنشاء حساب من خلال bra7tak.com في أي وقت عن طريق تقديم عنوان بريدك الإلكتروني وتعيين كلمة مرور وصول فريدة. لا تحتاج إلى إنشاء حساب من أجل زيارة موقعنا. يتيح لك إنشاء حساب حفظ معلومات فوترة معينة حتى تتمكن من تتبع حالة طلباتك وتعيين تفضيلات الطلب الخاصة بك. من أجل خصوصيتك وأمانك ، لا نقوم بتخزين أرقام بطاقات الائتمان في حسابك. يمكنك تغيير معلومات الحساب المحفوظة في أي وقت.
ملفات تعريف الارتباط ومعلومات الكمبيوتر الأخرى: عند الوصول إلى bra7tak .com سيتم تخزين الملفات النصية الصغيرة المعروفة باسم "ملفات تعريف الارتباط" على القرص الصلب لجهاز الكمبيوتر الخاص بك. يسمح لنا ملف تعريف الارتباط بتعزيز وتخصيص تجربة التسوق عبر الإنترنت وتحسين تصميم موقعنا. تخزن ملفات تعريف الارتباط هذه أرقام معرفات عشوائية ومعلومات حول زياراتك الأولى والأخيرة وعدد الزيارات ومحتويات عربة التسوق. يمكنك ضبط متصفح الويب الخاص بك لإعلامك عندما تتلقى ملف تعريف ارتباط ويمكنك أيضا مسح ملفات تعريف الارتباط من متصفحك بعد التسوق. إذا قمت بحذف ملفات تعريف الارتباط الخاصة بنا ، فإنك تحد من قدرتنا على تخصيص bra7tak.com لزيارتك التالية للتسوق ؛ ومع ذلك ، فإن حذف ملف تعريف الارتباط لن يمنعك من التسوق والشراء في موقعنا في المستقبل.
قد نقوم أيضا بجمع معلومات فنية معينة من جهاز الكمبيوتر الخاص بك. قد تتضمن هذه المعلومات الفنية عنوان بروتوكول الإنترنت (IP) الخاص بك ونظام تشغيل جهاز الكمبيوتر الخاص بك ونوع المتصفح وعنوان موقع الويب المرجعي ، إن وجد. باستثناء حالة عناوين IP ، لا يمكن استخدام هذه المعلومات الفنية لتحديد هويتك. علاوة على ذلك ، لا نستخدم عادة عناوين IP لتحديد هوية أي شخص. ومع ذلك ، قد نقوم بذلك لتحديد الأنشطة غير المصرح بها ومتابعة الإجراءات القانونية.
التسويق النصي والإشعارات:
من خلال تقديم رقم هاتفك أثناء الخروج وبدء عملية شراء ، أو الاشتراك من خلال نماذج الاشتراك حيث يتم توفير رقم هاتف ، أو إرسال عبارة كلمة رئيسية ، فإنك تمنحنا الموافقة على إرسال رسائل نصية إليك. يمكن إرسال هذه الرسائل لتقديم معلومات حول منتجاتنا وخدماتنا وعروضنا الترويجية ، بما في ذلك تذكيرات سلة التسوق المهجورة. الموافقة ليست شرطا للشراء. قد يتم تطبيق أسعار الرسائل والبيانات. يختلف تكرار الرسالة.
يمكنك إلغاء الاشتراك من تلقي الرسائل النصية في أي وقت عن طريق الرد على أي رسالة مرسلة منا أو عن طريق النقر فوق رابط إلغاء الاشتراك الموجود في أي من رسائلنا. أنت تدرك أن هناك خيارات بديلة لإلغاء الاشتراك في رسائلنا النصية وأن الطلبات اليدوية لن تنسب كوسيلة معقولة لإلغاء الاشتراك في رسائلنا النصية. أرسل HELP إلى أي رسالة مرسلة من قبلنا للحصول على مزيد من المعلومات. لأية أسئلة تتعلق بسياستنا أو إلغاء الاشتراك ، يمكنك الاتصال بنا على عنوان البريد الإلكتروني. لإلغاء الاشتراك ، يرجى اتباع الإجراءات المذكورة abov
كيف سيتم استخدام معلوماتي؟
يمكن استخدام المعلومات التي يتم جمعها على bra7tak.com بالطرق التالية:
•	جدولة تسليم البضائع التي تشتريها عبر الإنترنت.
•	قم بإنشاء حساب عبر الإنترنت لك على bra7tak.com
•	قم بفوترة بطاقتك الائتمانية لمشترياتك.
•	تأكيد وتتبع طلباتك.
•	الرد على استفسارات خدمة العملاء الخاصة بك.
•	قدم لك اتصالات ترويجية ومعلومات أخرى ، إذا اخترت تلقيها.
•	قدم المنتجات التي تريدها.
•	تحسين حملاتنا الإعلانية.
•	تخصيص تجربة التسوق الخاصة بك.
•	مراجعة تصميم موقعنا على أساس معلومات مجهولة المصدر حول زوار موقعنا.
•	نحن لا نؤجر أو نبيع اسمك لشركات خارجية لأغراض التسويق الخاصة بهم. نحن نقدم معلوماتك إلى المنظمات ذات السمعة الطيبة التي تساعدنا في تلبية طلبك و / أو لشركائنا في العمل.
الوصول إلى معلوماتي وتحديثها
يمكنك الوصول إلى المعلومات التي شاركتها معنا عبر الإنترنت وتصحيحها إذا كنت قد أنشأت حسابا مع bra7tak.com. ما عليك سوى تسجيل الدخول باستخدام اسم المستخدم وكلمة المرور وتعديل أو حذف أي معلومات تريدها. لا تشارك  كلمة مرور bra7tak .com مع أي شخص.
حماية الخصوصية
نحن نحمي قواعد البيانات الخاصة بنا بمختلف التدابير المادية والتقنية والإجرائية ونقيد الوصول إلى معلوماتك من قبل أشخاص غير مصرح لهم.
نحن نستخدم تقنية Secure Sockets Layer (SSL) ، وهي معيار التجارة الإلكترونية لتأمين المعلومات أثناء انتقالها عبر الإنترنت. تم تصميم تقنية SSL لتشفير معلوماتك ، ومنع أي طرف غير مصرح له من عرض معلوماتك وتنزيلها. يجب أن يعرض متصفح الويب الخاص بك عنوان ويب ببادئة "https" ، مما يشير إلى أن تقنية SSL تعمل عند استخدام أجزاء معينة من موقعنا على الويب ، مثل ميزات التسجيل والسحب.
حقوق الملكية
جميع المحتويات المضمنة في موقع bra7tak.com بما في ذلك المعلومات والبيانات والبرامج والصور الفوتوغرافية والرسوم البيانية ومقاطع الفيديو والمحارف والرسومات والموسيقى والأصوات والمواد الأخرى (يشار إليها مجتمعة باسم "المحتوى") محمية بموجب حقوق الطبع والنشر أو العلامات التجارية أو براءات الاختراع أو حقوق الملكية الأخرى ، وهذه الحقوق صالحة ومحمية بجميع الأشكال والوسائط والتقنيات الموجودة الآن أو المطورة في المستقبل.
أمن
إذا كنت تستخدم هذا الموقع ، فأنت مسؤول عن الحفاظ على سرية حسابك وكلمة المرور وتقييد الوصول إلى جهاز الكمبيوتر الخاص بك. أنت توافق على قبول المسؤولية عن جميع الأنشطة التي تحدث تحت حسابك وكلمة المرور الخاصة بك.
لا يجوز استخدام موقع bra7tak.com إلا لأغراض قانونية.


            """,
        }

    def get_city_name_by_id(self, city_code: int, lang: str):
        print(city_code)
        print(lang)
        return self.cities[lang][city_code]

    def get_gender_by_id(self, gender_code: int, lang: str):
        return self.genders[lang][gender_code]
